Golang 简称 Go，是谷歌2009发布的开源编程语言，在2012年早些时候发布了Go 1稳定版本。

Go是从2007年末由Robert Griesemer, Rob Pike, Ken Thompson主持开发，后来还加入了Ian Lance Taylor, Russ Cox等人。阵容相当强大。
Go被称为21世纪的C语言。目前使用Go语言开发的一些优秀的开源项目有：Docker、tidb、kubernetes等。

Go主要有静态语言、天生并发、内置GC、安全性高、语法简单、交叉编译和编译快速这几个方面的特性。这些特性决定了Go的三个高富帅特性：运行快、开发快和部署快，而这些特性都是针对Google遇到的一些痛点来设计的。

为什么选择使用Go语言？
1、学习曲线
它包含了类C语法、GC内置和工程工具。有编程经验的人，只要一个星期左右即可上手。

2、效率
Go拥有接近C的运行效率，能满足大部分需求。

3、自由高效：组合的思想、无侵入式的接口
Go语言可以说是开发效率和运行效率二者的完美融合，天生的并发编程支持。Go语言支持当前所有的编程范式，包括过程式编程、面向对象编程以及函数式编程。程序员们可以各取所需、自由组合、想怎么玩就怎么玩。

4、强大的标准库
这包括互联网应用、系统编程和网络编程。Go里面的标准库基本上已经是非常稳定了，特别是我这里提到的三个，网络层、系统层的库非常实用。

5、部署方便：
go最终生成的是一个 可执行文件，不管你的程序依赖多少库，都会被打包进行，生成一个可执行文件。

7、简单的并发
使用go和channel即可编写灵活的并发程序。

8、工程支持
Go提供了软件生命周期（开发、测试、部署、维护等等）的各个环节的工具，如go tool、gofmt、go test。




相关书籍
《Go语言编程》
《Go语言实战》
《Go Web编程》

相关网站
https://golang.org
https://www.golangtc.com/
https://studygolang.com/

